FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_DKTSKIT_TS.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_DKTSKIT_TS.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Device implementation of the Four Wire Touchscreen interface
 *      for the DKTSKIT with SOMDIMM-RX62N.  This should be replaced
 *      later with more generic drivers.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <Device/Touchscreen.h>
#include <HAL/HAL.h>
#include <HAL/GPIO.h>
#include <Types/ADC.h>
#include <Device/ADCBank.h>
#include "RX62N_DKTSKIT_TS.h"
#include <uEZProcessor.h>

/* Touchscreen hardware connections */
#define OUT_TS_XL_PORT  8    /* driver port/pin for terminal resistor at left of screen */
#define OUT_TS_XL_PIN   5
#define OUT_TS_XR_PORT  8    /* driver port/pin for terminal resistor at right of screen */
#define OUT_TS_XR_PIN   5
#define OUT_TS_YL_PORT  8    /* driver port/pin for terminal resistor at bottom of screen */
#define OUT_TS_YL_PIN   4
#define OUT_TS_YU_PORT  8    /* driver port/pin for terminal resistor at top of screen */
#define OUT_TS_YU_PIN   4

#if 1
    #define ADC_TS_XL 7     /* channel connected to terminal resistor at left of screen */
    #define ADC_TS_XR 5     /* channel connected to terminal resistor at right of screen */
    #define ADC_TS_YL 4     /* channel connected to terminal resistor at bottom of screen */
    #define ADC_TS_YU 6     /* channel connected to terminal resistor at top of screen */
#else
    #define ADC_TS_XL 4     /* channel connected to terminal resistor at left of screen */
    #define ADC_TS_XR 6     /* channel connected to terminal resistor at right of screen */
    #define ADC_TS_YL 7     /* channel connected to terminal resistor at bottom of screen */
    #define ADC_TS_YU 5     /* channel connected to terminal resistor at top of screen */
#endif

/*---------------------------------------------------------------------------*
 * Constants:
 *---------------------------------------------------------------------------*/
#ifndef NUM_CALIBRATE_POINTS_NEEDED
#define NUM_CALIBRATE_POINTS_NEEDED     3
#endif

#ifndef NUM_DUMMY_SAMPLES_PER_READING
#define NUM_DUMMY_SAMPLES_PER_READING   16
#endif

#ifndef NUM_SAMPLES_PER_READING
#define NUM_SAMPLES_PER_READING         32
#endif

#ifndef DEFAULT_TOUCHSCREEN_HIGH_LEVEL
#define DEFAULT_TOUCHSCREEN_HIGH_LEVEL        0x5000
#endif

#ifndef DEFAULT_TOUCHSCREEN_LOW_LEVEL
#define DEFAULT_TOUCHSCREEN_LOW_LEVEL         0x1000
#endif

#define COMPARE_LIMIT (64)

/* memory for DDR shadowing...used by DDR_xxxx Macros */
extern unsigned char P1DDRS, P2DDRS, P3DDRS, P4DDRS, P5DDRS, P6DDRS, P8DDRS, PADDRS, PBDDRS, PCDDRS,PDDDRS, PEDDRS, PFDDRS,  PGDDRS, PHDDRS, PIDDRS, PJDDRS, PKDDRS, PLDDRS, PMDDRS;

/* convert 'a' to a string */
#define TO_STR1(a) #a
#define TO_STR(a) TO_STR1(a)

/* Define Pin Macros to ease implementation (secondary macros _1, _2 used for expansion ONLY */
#define CAT(a,b) a ## b
#define MERGE2(a,b) CAT(a,b)

#define DDRo2(port,pin) MERGE2(PORT,port) ## MERGE2(.DDR.BIT.B,pin) = 1;
#define DDRi2(port,pin) MERGE2(PORT,port) ## MERGE2(.DDR.BIT.B,pin) = 0;
#define PINo2(port,pin) MERGE2(PORT,port) ## MERGE2(.DR.BIT.B,pin)
#define PINi2(port,pin) MERGE2(PORT,port) ## MERGE2(.PORT.BIT.B,pin)
#define ICRi2(port,pin) MERGE2(PORT,port) ## MERGE2(.ICR.BIT.B,pin)

#define DDRo(signal) DDRo2(signal##_PORT, signal##_PIN)
/* Set signal DDR to input */
#define DDRi(signal) DDRi2(signal##_PORT, signal##_PIN)
/* Write signal level (for output) */
#define PINo(signal) PINo2(signal##_PORT, signal##_PIN)
/* Read signal level (for input) */
#define PINi(signal) PINi2(signal##_PORT, signal##_PIN)
/* Signals buffer control (for inputs) */
#define ICRi(signal) ICRi2(signal##_PORT, signal##_PIN)
#define size_ra(ra) (sizeof(ra)/sizeof(ra[0]))
/* macros to allow easy access to new style ICU bits and IODEFINE macros */
#define _ICU2_(func,unit_channel) _##func(unit_channel)
#define _ICU_(func,irq) _ICU2_(func, MERGE2(irq ## _UNIT, MERGE2(_,irq ## _CHANNEL)))


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const DEVICE_TOUCHSCREEN *iDevice;
    int aNumOpen;

    // Hardware linkage
    TS_RX62N_DKTSKIT_Configuration iConfig;

    // Calibration information
    TBool iIsCalibrating;
    TUInt32 iNumCalibratePoints;
    T_uezTSReading iCalibrateReadingsTaken[NUM_CALIBRATE_POINTS_NEEDED];
    T_uezTSReading iCalibrateReadingsExpected[NUM_CALIBRATE_POINTS_NEEDED];

    TBool iHaveCalibration;

    TInt32 iPenOffsetX;
    TInt32 iPenBaseX;
    TInt32 iPenXScaleTop;
    TInt32 iPenXScaleBottom;

    TInt32 iPenOffsetY;
    TInt32 iPenBaseY;
    TInt32 iPenYScaleTop;
    TInt32 iPenYScaleBottom;

    T_uezSemaphore iSem;

    TUInt32 iTDSLow;
    TUInt32 iTDSHigh;
    TBool iTDSWasPressed;
} T_TS_RX62N_DKTSKIT_Workspace;

#pragma bit_order left
#pragma unpack
struct st_dtc_xfer_full
{
  union
  {
    struct
    {
      unsigned long MRA_MD    :2;
      unsigned long MRA_SZ    :2;
      unsigned long MRA_SM    :2;
      unsigned long           :2;
      unsigned long MRB_CHNE  :1;
      unsigned long MRB_CHNS  :1;
      unsigned long MRB_DISEL :1;
      unsigned long MRB_DTS   :1;
      unsigned long MRB_DM    :2;
      unsigned long           :2;
      unsigned long           :16;
    }BIT;
    unsigned long LONG;
  }MR;
  void * SAR;
  void * DAR;
  struct
  {
    unsigned long CRA:16;
    unsigned long CRB:16;
  }CR;
};

struct st_dtc_xfer_short
{
  union
  {
    struct
    {
      unsigned long MRA_MD  :2;
      unsigned long MRA_SZ  :2;
      unsigned long MRA_SM  :2;
      unsigned long         :2;
      unsigned long SAR     :24;
    }BIT;
    unsigned long LONG;
  }SAR_MRA;
  union
  {
    struct
    {
      unsigned long MRB_CHNE  :1;
      unsigned long MRB_CHNS  :1;
      unsigned long MRB_DISEL :1;
      unsigned long MRB_DTS   :1;
      unsigned long MRB_DM    :2;
      unsigned long           :2;
      unsigned long DAR       :24;
    }BIT;
    unsigned long LONG;
  }DAR_MRB;
  struct
  {
    unsigned long CRA:16;
    unsigned long CRB:16;
  }CR;
};

#pragma bit_order
#pragma packoption

struct st_dtc_table
{
  union
  {
    struct
    {
      unsigned char MD  :2;
      unsigned char SZ  :2;
      unsigned char SM  :2;
      unsigned char     :2;
    }BIT;
    unsigned char BYTE;
  }MRA;
  union
  {
    struct
    {
      unsigned char CHNE  :1;
      unsigned char CHNS  :1;
      unsigned char DISEL :1;
      unsigned char DTS   :1;
      unsigned char DM    :2;
      unsigned char       :2;
    }BIT;
    unsigned char BYTE;
  }MRB;
  unsigned short dummy;
  unsigned long SAR;
  unsigned long DAR;
  unsigned short CRA;
  unsigned short CRB;
};

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
extern const DEVICE_TOUCHSCREEN TS_RX62N_DKTSKIT_Interface;

#pragma section DTC_VECT
const unsigned long dtc_vectors = 0;    /* start of DTC vector table */
#pragma section
#pragma section DTC_TABLE
struct st_dtc_xfer_full ad_dtc_table;

#pragma section DTC_VECT_S12AD
const struct st_dtc_xfer_full *const ad_dtc_vector = &ad_dtc_table;

/* return to normal section definition */
#pragma section
TUInt16 AD_Buffer[8][8];         // allocate buffer for 8 samples on each A/D channel

