FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_DKTSKIT_TS.c
void ad_dtc_init(void)
{
    memset(AD_Buffer, 0xCC, sizeof(AD_Buffer));
    
    /* configure A/D Converter */
      MSTP(S12AD) = 0;     /* enable A/D */
    S12AD.ADCSR.BIT.ADIE = 1; /* enable A/D to feed ICU */
    S12AD.ADCSR.BIT.ADCS = 1; /* continous scan */
    S12AD.ADCSR.BIT.CKS = 3; /* clock at pclk/1 */
    S12AD.ADANS.WORD = 0xFF;  /* enable sampling of all 8 channel */
    S12AD.ADADS.WORD = 0xFF;  /* enable multi-sample of all 8 channel */
    S12AD.ADADC.BYTE = 3;     /* configure for 4x addition */
    S12AD.ADCSR.BIT.ADST = 1; /* start conversions */

    ad_dtc_table.SAR = (void *)&S12AD.ADDRA;
    ad_dtc_table.DAR = AD_Buffer;
    ad_dtc_table.MR.LONG = 0;
    ad_dtc_table.MR.BIT.MRA_MD = 2;  // block transfer
    ad_dtc_table.MR.BIT.MRA_SZ = 1;  // long word transfer size (less bus cycles)
    ad_dtc_table.MR.BIT.MRA_SM = 2;  // increment source address
    ad_dtc_table.MR.BIT.MRB_DM = 2;  // increment destination address
    ad_dtc_table.MR.BIT.MRB_DTS = 1; // source side is block source
    ad_dtc_table.CR.CRA = 0x0808;            // 8 words (16 bytes) per transfer
    ad_dtc_table.CR.CRB = size_ra(AD_Buffer);  // number of block transfers

    S12AD.ADCSR.BIT.ADIE = 1;
    IEN(S12AD,ADI) = 1;
}

static void ad_dtc_acquire(void)
{
    ad_dtc_table.DAR = AD_Buffer;
    ad_dtc_table.CR.CRB = size_ra(AD_Buffer);  // number of block transfers
    IR(S12AD,ADI) = 0;
    DTCE(S12AD,ADI) = 1;
}

static TUInt16 ad_dtc_value(int channel)
{
    int index;
    TUInt32 value;

    if (channel >= size_ra(AD_Buffer[1]))
      return(0);

    /* sum values */
    for (index=0, value=0; index < size_ra(AD_Buffer); index++)
      value += AD_Buffer[index][channel];

    /* shift data */
    value /= 64;
    return ((TUInt16)value);
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup workspace for the TI TSC2046.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_InitializeWorkspace(void *aW)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aW;
    return UEZSemaphoreCreateBinary(&p->iSem);
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_Open
 *---------------------------------------------------------------------------*
 * Description:
 *      The TI TSC2046 is being opened.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_Open(void *aW)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aW;
    p->aNumOpen++;

    if (p->aNumOpen == 1) {
        PINo(OUT_TS_XR) = 0;
        PINo(OUT_TS_XL) = 0;
        PINo(OUT_TS_YU) = 0;
        PINo(OUT_TS_YL) = 0;
        DDRo(OUT_TS_XL);
        DDRo(OUT_TS_XR);
        DDRo(OUT_TS_YU);
        DDRo(OUT_TS_YL);
        ad_dtc_init();
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_Close
 *---------------------------------------------------------------------------*
 * Description:
 *      The TI TSC2046 is being closed.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_Close(void *aW)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aW;
    p->aNumOpen--;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      The SPI bus and GPIO device are being declared.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_Configure(
                T_uezDeviceWorkspace *aW,
                TS_RX62N_DKTSKIT_Configuration *aConfig)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aW;
    p->iConfig = *aConfig;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_ReadTouch
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the X location being touched (if any)
 * Inputs:
 *      T_TS_RX62N_DKTSKIT_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError TS_RX62N_DKTSKIT_ReadTouch(T_TS_RX62N_DKTSKIT_Workspace *p, TBool *aValue)
{
    TInt16 compare;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    ad_dtc_acquire();
    UEZTaskDelay(1);

    compare = (TInt16)ad_dtc_value(ADC_TS_XL) + (TInt16)ad_dtc_value(ADC_TS_XR);
    compare -= (TInt16)ad_dtc_value(ADC_TS_YU) + (TInt16)ad_dtc_value(ADC_TS_YL);
    compare = (compare >= 0)? compare:-compare;
    if (compare > COMPARE_LIMIT)
        *aValue = EFalse;
    else
        *aValue = ETrue;

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_ReadX
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the X location being touched (if any)
 * Inputs:
 *      T_TS_RX62N_DKTSKIT_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError TS_RX62N_DKTSKIT_ReadX(
        T_TS_RX62N_DKTSKIT_Workspace *p,
        TUInt32 *aValue)
{
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // read axis values...even if not touched to keep timing consistant
    // Assert Y axis drivers
    PINo(OUT_TS_YU) = 1;
    PINo(OUT_TS_YL) = 1;

    // Wait for inputs to settle
    UEZTaskDelay(1);

