FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_DKTSKIT_TS.c
    // Read Y axis inputs
    ad_dtc_acquire();
    UEZTaskDelay(1);
    *aValue = (TInt16)ad_dtc_value(ADC_TS_XL) + (TInt16)ad_dtc_value(ADC_TS_XR);

    // de-assert Y axis drivers
    PINo(OUT_TS_YU) = 0;
    PINo(OUT_TS_YL) = 0;

    UEZTaskDelay(1);

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_ReadY
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the Y location being touched (if any)
 * Inputs:
 *      T_TS_RX62N_DKTSKIT_Workspace *p    -- Workspace
 *      TUInt32 *aValue             -- Pointer to value read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError TS_RX62N_DKTSKIT_ReadY(
        T_TS_RX62N_DKTSKIT_Workspace *p,
        TUInt32 *aValue)
{
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Assert X axis drivers
    PINo(OUT_TS_XL) = 1;
    PINo(OUT_TS_XR) = 1;

    // Wait for inputs to settle
    UEZTaskDelay(1);

    // Read X axis input
    ad_dtc_acquire();
    UEZTaskDelay(1);
    *aValue = (TInt16)ad_dtc_value(ADC_TS_YU) + (TInt16)ad_dtc_value(ADC_TS_YL);

    // de-assert X axis drivers
    PINo(OUT_TS_XL) = 0;
    PINo(OUT_TS_XR) = 0;

    // Wait for inputs to settle
    UEZTaskDelay(1);

    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_ApplyCalibration
 *---------------------------------------------------------------------------*
 * Description:
 *      Given the x, y raw coordinates, calculate the proper x, y
 *      calibrated coordinates.
 * Inputs:
 *      T_TS_RX62N_DKTSKIT_Workspace *p    -- Workspace
 *      TUInt32 x, y                -- Raw x, y values
 *      TUInt32 *newX, *newY        -- Pointer to calibrated x, y values
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static void TS_RX62N_DKTSKIT_ApplyCalibration(
                    T_TS_RX62N_DKTSKIT_Workspace *p,
                    TUInt32 x,
                    TUInt32 y,
                    TUInt32 *newX,
                    TUInt32 *newY)
{
    TInt32 v;

    v = x - p->iPenOffsetX;
    v *= p->iPenXScaleTop;
    v /= p->iPenXScaleBottom;
    v += p->iPenBaseX;
    *newX = (TUInt32)v;

    v = y - p->iPenOffsetY;
    v *= p->iPenYScaleTop;
    v /= p->iPenYScaleBottom;
    v += p->iPenBaseY;
    *newY = (TUInt32)v;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_Poll
 *---------------------------------------------------------------------------*
 * Description:
 *      Take a reading from the TSC2406 and put in reading structure.
 * Inputs:
 *      void *aW                    -- Workspace
 *      T_uezTSReading *aReading     -- Pointer to final reading
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_Poll(void *aWorkspace, T_uezTSReading *aReading)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aWorkspace;
    T_uezError error;
    TUInt32 x, y;
    TBool isTouch, isTouch2;

    error = TS_RX62N_DKTSKIT_ReadTouch(p, &isTouch);
    if (error)
        return error;

    error = TS_RX62N_DKTSKIT_ReadX(p, (TUInt32 *)&aReading->iX);
    if (error)
        return error;

    error = TS_RX62N_DKTSKIT_ReadY(p, (TUInt32 *)&aReading->iY);
    if (error)
        return error;

    // Make sure we are still touching
    error = TS_RX62N_DKTSKIT_ReadTouch(p, &isTouch2);
    if (error)
        return error;

    x = aReading->iX;
    y = aReading->iY;

    if (!isTouch2)
        isTouch = EFalse;

    if (isTouch) {
        aReading->iFlags = TSFLAG_PEN_DOWN;

        if ((!p->iIsCalibrating) && (p->iHaveCalibration)) {
            // Convert X & Y coordinates
            TS_RX62N_DKTSKIT_ApplyCalibration(p, x, y, (TUInt32 *)&aReading->iX, (TUInt32 *)&aReading->iY);
        }
    } else {
        // Pen is not down
        aReading->iFlags = 0;
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_CalibrateStart
 *---------------------------------------------------------------------------*
 * Description:
 *      Start calibration mode.  All readings will now report raw data.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_CalibrateStart(void *aWorkspace)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aWorkspace;

    p->iIsCalibrating = ETrue;
    p->iNumCalibratePoints = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_CalibrateEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      Calibration is complete.  Compute the calibration matrix and use.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *                                      Return ERROR_OUT_OF_RANGE if
 *                                      calibration is bad.  Returns
 *                                      UEZ_ERROR_NOT_ENOUGH_DATA if not
 *                                      enough data points were added.
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_CalibrateEnd(void *aWorkspace)
{
    TUInt32 minIX, maxIX, minOX, maxOX;
    TUInt32 minIY, maxIY, minOY, maxOY;
    TUInt32 i;

    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aWorkspace;

