FutureDesigns/uEZ/uEZ/Source/Devices/Touchscreen/Renesas/RX62N/RX62N_DKTSKIT_TS.c
    p->iIsCalibrating = EFalse;

    if (p->iNumCalibratePoints == NUM_CALIBRATE_POINTS_NEEDED)  {
        // Do the calibration algorithm here
        minIX = minOX = minIY = minOY = 0xFFFFFFFF;
        maxIX = maxOX = maxIY = maxOY = 0;

        for (i=0; i<p->iNumCalibratePoints; i++)  {

            // Find range of inputs
            if (p->iCalibrateReadingsTaken[i].iX < minIX) {
                minIX = p->iCalibrateReadingsTaken[i].iX;
                minOX = p->iCalibrateReadingsExpected[i].iX;
            }
            if (p->iCalibrateReadingsTaken[i].iX > maxIX) {
                maxIX = p->iCalibrateReadingsTaken[i].iX;
                maxOX = p->iCalibrateReadingsExpected[i].iX;
            }
            if (p->iCalibrateReadingsTaken[i].iY < minIY) {
                minIY = p->iCalibrateReadingsTaken[i].iY;
                minOY = p->iCalibrateReadingsExpected[i].iY;
            }
            if (p->iCalibrateReadingsTaken[i].iY > maxIY) {
                maxIY = p->iCalibrateReadingsTaken[i].iY;
                maxOY = p->iCalibrateReadingsExpected[i].iY;
            }

        }

        // Find scale factor of X
        p->iPenOffsetX = minIX;
        p->iPenBaseX = minOX;
        p->iPenXScaleTop = maxOX - minOX;
        p->iPenXScaleBottom = maxIX - minIX;

        // Find scale factor of Y
        p->iPenOffsetY = minIY;
        p->iPenBaseY = minOY;
        p->iPenYScaleTop = maxOY - minOY;
        p->iPenYScaleBottom = maxIY - minIY;

        p->iHaveCalibration = ETrue;

        // Check to see if this is valid calibration data
        // (should have a resolution of at least 5 bits per pixel output
        // using 10 bit ADCs).
        // This check doesn't catch everything but will help catch
        // most of the bogus readings (such as all the same points)
//        if ((p->iPenXScaleBottom < p->iPenXScaleTop*32) ||
//                (p->iPenYScaleBottom < p->iPenYScaleTop*32)) {
//            return UEZ_ERROR_OUT_OF_RANGE;
//        }
    } else {
        return UEZ_ERROR_NOT_ENOUGH_DATA;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_CalibrateAdd
 *---------------------------------------------------------------------------*
 * Description:
 *      Add a calibration point to the calibration data.
 * Inputs:
 *      void *aW                    -- Workspace
 *      const T_uezTSReading *aReadingTaken -- Raw reading values
 *      const T_uezTSReading *aReadingExpected -- Expected output reading
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_CalibrateAdd(
                    void *aWorkspace,
                    const T_uezTSReading *aReadingTaken,
                    const T_uezTSReading *aReadingExpected)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aWorkspace;
    TUInt32 num;

    num = p->iNumCalibratePoints;
    if (num < NUM_CALIBRATE_POINTS_NEEDED)  {
        p->iCalibrateReadingsTaken[num] = *aReadingTaken;
        p->iCalibrateReadingsExpected[num] = *aReadingExpected;
        p->iNumCalibratePoints++;
    } else {
        return UEZ_ERROR_OVERFLOW;
    }

    // Report an error if there is not enough data
    if (p->iNumCalibratePoints < NUM_CALIBRATE_POINTS_NEEDED)
        return UEZ_ERROR_NOT_ENOUGH_DATA;

    // Got enough, good.
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  TS_RX62N_DKTSKIT_SetTouchDetectSensitivity
 *---------------------------------------------------------------------------*
 * Description:
 *      Sets the touch sensitivity for detecting a touch on the screen.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt16 aLowLevel           -- 16-bit low level.  0xFFFF is full 100%
 *                                      sensitivity, 0 is no sensitivity.
 *      TUInt16 aHighLevel          -- 16-bit high level.  0xFFFF is no (0%)
 *                                      sensitivity, 0xFFFF is no sensitivity.
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError TS_RX62N_DKTSKIT_SetTouchDetectSensitivity(
            void *aWorkspace,
            TUInt16 aLowLevel,
            TUInt16 aHighLevel)
{
    T_TS_RX62N_DKTSKIT_Workspace *p = (T_TS_RX62N_DKTSKIT_Workspace *)aWorkspace;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    // Shift down the sensitivity to be a 10 bit reading
    // then multiply by the number of readings.
    p->iTDSLow = (aLowLevel>>6)*NUM_SAMPLES_PER_READING;
    p->iTDSHigh = (aHighLevel>>6)*NUM_SAMPLES_PER_READING;
    UEZSemaphoreRelease(p->iSem);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_TOUCHSCREEN Touchscreen_RX62N_DKTSKIT_Interface = {
	{
	    // Common interface
	    "Touchscreen:RX62N:DKTSKIT:4Wire",
	    0x0100,
	    TS_RX62N_DKTSKIT_InitializeWorkspace,
	    sizeof(T_TS_RX62N_DKTSKIT_Workspace),
	},
	
    // Functions
    TS_RX62N_DKTSKIT_Open,
    TS_RX62N_DKTSKIT_Close,
    TS_RX62N_DKTSKIT_Poll,

    TS_RX62N_DKTSKIT_CalibrateStart,
    TS_RX62N_DKTSKIT_CalibrateAdd,
    TS_RX62N_DKTSKIT_CalibrateEnd,

    TS_RX62N_DKTSKIT_SetTouchDetectSensitivity,
} ;

/*-------------------------------------------------------------------------*
 * End of File:  RX62N_DKTSKIT_TS.c
 *-------------------------------------------------------------------------*/
